1=  OKANRAN Odu regido por Exu. Voc\u00ea parece ser agressivo, mas na verdade est\u00e1 apenas lutando para preservar a independ\u00eancia da qual muito se orgulha. Voc\u00ea n\u00e3o poupa esfor\u00e7os para atingir seus objetivos, mas deve tomar cuidado para n\u00e3o arrumar inimigos \u00e0 toa.
2=  EJIOK\u00d4 Odu regido pelos Ibejis e Ogun. Voc\u00ea se mostra calmo no comportamento e seguro nas decis\u00f5es, mas na sua mente sempre existem d\u00favidas. N\u00e3o tenha medo de externar estas incertezas. Como muitas pessoas o amam, voc\u00ea acabar\u00e1 recebendo bons conselhos.
3=  ETA-OGUND\u00c1 Odu regido por Ogun e Obaluai\u00ea. A obstina\u00e7\u00e3o que se traduz em agita\u00e7\u00e3o e inconformismo, \u00e9 uma das suas principais caracter\u00edsticas. Mas, se usar suas qualidades, como a coragem, criatividade e a perseveran\u00e7a, conseguir\u00e1 o que mais anseia: o poder e o sucesso.
4=  YROSUN Odu regido por Ians\u00e3, Iemanj\u00e1. Sempre sereno e disposto a ver tudo com muita clareza e objetividade, voc\u00ea sabe resolver situa\u00e7\u00f5es confusas ou tumultuadas. Tem plena consci\u00eancia da sua for\u00e7a moral e n\u00e3o hesita em us\u00e1-la para atingir todas as suas metas.
5=  OX\u00c9 Odu regido por Oxum e Logun Ed\u00ea. Sens\u00edvel e sempre atento, voc\u00ea \u00e9 uma pessoa sempre disposta a proporcionar alegria aos outros. Mas h\u00e1 momentos nos quais voc\u00ea precisa de isolamento para poder refletir, pois preza muito sua liberdade e, sobretudo, seu, crescimento.
6=  OBAR\u00c1 Odu regido por Oxossi e Xang\u00f4. Voc\u00ea luta com unhas e dentes pelo que quer e geralmente consegue muito sucesso material. Mas, no amor precisa entender que n\u00e3o pode exigir demais dos outros.
7=  ODI Odu regido por Omolu e Exu. Voc\u00ea realmente est\u00e1 satisfeito com o que consegue. Mas n\u00e3o fica se lamentando. Prefere ir \u00e0 luta. Caso aprenda com clareza seus objetivos, alcan\u00e7ar\u00e1 grandes \u00eaxitos.
8=  EJIONILE Odu regido por Oxagui\u00e3n, Ogun e Xango Air\u00e1. Sua agilidade mental faz de voc\u00ea uma pessoa falante e muito ativa. Al\u00e9m disso, voc\u00ea gosta de poder e prest\u00edgio, por isso luta com muita intensidade pra chegar ao topo. Muitas vezes tempestuoso, e incontrolavel, mas seu senso de justi\u00e7a o impede de prejudicar quem quer que seja.
9=  OS\u00c1 Odu regido por Iemanj\u00e1 e Ians\u00e3. Voc\u00ea \u00e9 uma pessoa que gosta de estudar cuidadosamente todas as coisas a sua volta, tem uma larga vis\u00e3o do mundo, por isso esta sempre pronto a poder ajudar, seja quem for. Dica: Se quiser manter a paz no seu dia a dia sera preciso aprender a n\u00e3o deixar fatos externos interferir em sua vida pessoal.
10= OFUN Odu regido por Oxal\u00e1. Seu jeit\u00e3o rabugento \u00e9 apenas um escudo para que os outros n\u00e3o abusem da sua boa vontade e sensibilidade. No fundo, voc\u00ea \u00e9 uma pessoa serena, que se adapta aos autos e baixos da vida.
11= OWANRIN Odu regido por Ians\u00e3, Ogun e Exu. A pressa e a coragem s\u00e3o suas caracter\u00edsticas. Tenso e agitado, voc\u00ea nunca fica muito tempo no mesmo lugar, a n\u00e3o ser que se sinta obrigado. Pode n\u00e3o obter grande sucesso material, mas a vida sempre lhe reserva muitas alegrias.
12= EJILAXEBOR\u00c1 Odu regido por Xang\u00f4. Sua principal virtude \u00e9 o amor \u00e0 justi\u00e7a, que algumas vezes se transforma em intoler\u00e2ncia com os erros alheios. Nessas ocasi\u00f5es, voc\u00ea deve se voltar para outras de suas qualidades: a dedica\u00e7\u00e3o, que lhe permite ajudar todas as pessoas.
13= EJI-OLOGBON Odu regido por Nan\u00e3 e Obaluai\u00ea. Voc\u00ea est\u00e1 quase sempre um pouco deprimido. S\u00f3 faz o que quer quando quer o como quer. Mas, como tem grande capacidade de reflex\u00e3o, acaba se adaptando e consegue viver bem com os outros.
14= IK\u00c1-MEJI Odu regido por Oxumar\u00ea. Paci\u00eancia e sabedoria s\u00e3o suas principais caracter\u00edsticas. Vers\u00e1til, voc\u00ea se d\u00e1 bem em qualquer atividade. Poder\u00e1 passar por prova\u00e7\u00f5es materiais e sentimentais, mas sempre saber\u00e1 reencontrar o caminho para a felicidade.
15= OBE-OGUND\u00c1 Odu regido por Ogun, Iemanj\u00e1, Omolu e Ob\u00e1. Voc\u00ea uma pessoa rebelde e cheia de vontades, que muitas vezes n\u00e3o resiste a defender seu ponto de vista mesmo depois que percebe que est\u00e1 errado. Por isso, deve tomar cuidado para n\u00e3o se deixar dominar pelo nervosismo.
16= ALAFI\u00c1 Odu regido por Oxal\u00e1 e Orumil\u00e1. Suas principais caracter\u00edsticas s\u00e3o a tranq\u00fcilidade e alegria. Amante da paz, voc\u00ea cria um clima de harmonia \u00e1 sua volta. Se mantiver o equil\u00edbrio, sem d\u00favida alcan\u00e7ar\u00e1 o sucesso.

1$=OKANRAN Odu regido por Exu.
2$= EJIOK\u00d4 Odu regido pelos Ibejis e Ogun.
3$=ETA-OGUND\u00c1 Odu regido por Ogun e Obaluai\u00ea.
4$=YROSUN Odu regido por Ians\u00e3, Iemanj\u00e1.
5$=OX\u00c9 Odu regido por Oxum e Logun Ed\u00ea.
6$=OBAR\u00c1 Odu regido por Oxossi e Xang\u00f4.
7$=ODI Odu regido por Omolu e Exu.
8$=EJIONILE Odu regido por Oxagui\u00e3n, Ogun e Xango Air\u00e1.
9$=Iemanj\u00e1 e Ians\u00e3. 
10$=Oxal\u00e1 
11$=Ians\u00e3
12$=Xang\u00f4.
13$=Nan\u00e3 e Obaluai\u00ea
14$=Oxumar\u00ea
15$=Ogun
16$=Oxal\u00e1 e Orumil\u00e1